Тест1/src/Reports/ОтчетПоМашине/ОтчетПоМашине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоМашине</name>
</mdclass:Report>

Тест1/src/AccumulationRegisters/ИнформацияОПродажах/ИнформацияОПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИнформацияОПродажах</name>
  <resources>
    <name>колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/Reports/ОтчетПоМашине/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьМашину();
КонецПроцедуры

&НаКлиенте
Процедура Показать(Команда)
	// Вставить содержимое обработчика.
	УстановитьМашину();
	ПосчитатьИтого();
КонецПроцедуры

&НаСервере
Процедура УстановитьМашину()
	Таблица.Параметры.УстановитьЗначениеПараметра("Машина",Машина);
КонецПроцедуры

&НаСервере
Процедура ПосчитатьИтого()
	Запрос = Новый Запрос();
	Если ОплаченоИНеРазделено <> Истина Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(ИнформацияОПродажахОстатки.цена * ИнформацияОПродажахОстатки.колвоОстаток) КАК Поле1
		|ИЗ
		|	РегистрНакопления.ИнформацияОПродажах.Остатки КАК ИнформацияОПродажахОстатки
		|ГДЕ
		|	ИнформацияОПродажахОстатки.машина = &машина";
		
		
		// ++ obrv 12.11.18
		Запрос.Текст = ЭтаФорма.Таблица.ТекстЗапроса;
		// -- obrv 12.11.18
		
		Запрос.УстановитьПараметр("машина",Машина);
		Реультат = Запрос.Выполнить();
	    Таблица2 = Реультат.Выгрузить();
		// ++ obrv 13.02.19
		//ИтогиДоход = Таблица2.Итог("Поле1");
		ИтогиДоход = Таблица2.Итог("СуммаОплачено");
		// -- obrv 13.02.19
	Иначе
		ИтогиДоход = 0;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПродажаЗапчастей.Таблица.(
		               |		Ссылка,
		               |		НомерСтроки,
		               |		Товар,
		               |		Количество,
		               |		Цена,
		               |		Скидка,
		               |		машина,
		               |		цена1,
		               |		Комментарий
		               |	)
		               |ИЗ
		               |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
		               |ГДЕ
		               |	ПродажаЗапчастей.Оплачено = ИСТИНА
		               |	И ПродажаЗапчастей.ОтданоМарату = ЛОЖЬ";
		Реультат = Запрос.Выполнить();
	    Таблица3 = Реультат.Выгрузить();
		ОтданоМарату = 0;
		Для Каждого табл Из Таблица3 Цикл
			Для Каждого строка Из табл.Таблица Цикл
				Если строка.машина = Машина Тогда
					ИтогиДоход = ИтогиДоход + строка.цена*строка.Количество-строка.Скидка;
				КонецЕсли
			КонецЦикла
		КонецЦикла;
		
	КонецЕсли;
	прибыль = ИтогиДоход - Машина.Сумма;	
КонецПроцедуры


&НаКлиенте
Процедура Печать(Команда)
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заголовок = "Проданные запчасти для " + Машина;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	ОбластьМакета.Параметры.Итого = "" + ИтогиДоход + "р.";
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблица");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Табл = ПолучитьТаблицу(); 
	Для Каждого СтрокаТабличнойЧасти Из Табл Цикл
		Строка.Параметры.Наименование = СтрокаТабличнойЧасти.Товар.Наименование;
		Строка.Параметры.Артикул = СтрокаТабличнойЧасти.Товар.Артикул;
		Строка.Параметры.Колво = СтрокаТабличнойЧасти.КолвоОстаток;
		Строка.Параметры.Цена = СтрокаТабличнойЧасти.Цена;
		ТабДокумент.Вывести(Строка);
	КонецЦикла;
	
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.ОтчетПоМашине.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция ПолучитьТаблицу()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнформацияОПродажахОстатки.Товар,
	|	ИнформацияОПродажахОстатки.цена,
	|	ИнформацияОПродажахОстатки.колвоОстаток
    |	ИЗ
	|	РегистрНакопления.ИнформацияОПродажах.Остатки КАК ИнформацияОПродажахОстатки
|	ГДЕ
	|	ИнформацияОПродажахОстатки.машина = &Машина";
	
	// ++ obrv 12.11.18
	Запрос.Текст = ЭтаФорма.Таблица.ТекстЗапроса;
	// -- obrv 12.11.18
	
	
	Запрос.УстановитьПараметр("машина",Машина);
	Реультат = Запрос.Выполнить();
    Возврат Реультат.Выгрузить();
КонецФункции
